# YOLO26 detection — P2/P3/P4 head (no P5).
# Derived from the official ultralytics/cfg/models/26/yolo26-p2.yaml by removing
# the final P5 head branch and pointing Detect at [P2, P3, P4] only.
# Use case (E2 in the demo plan): focus capacity on small/medium maritime targets,
# trim params/FLOPs by discarding the P5/32 output that buoys / small_boat never need.

nc: 80                # auto-rebuilt to data.yaml.nc at train time
end2end: True         # YOLO26 NMS-free dual-head training
reg_max: 1            # YOLO26 removes DFL bins (reg_max=1)
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5  P4/16
  - [-1, 2, C3k2, [512, True]]             # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]      # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12  cat backbone P4
  - [-1, 2, C3k2, [512, True]]                   # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15  cat backbone P3
  - [-1, 2, C3k2, [256, True]]                   # 16  P3/8-small

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17
  - [[-1, 2], 1, Concat, [1]]                    # 18  cat backbone P2
  - [-1, 2, C3k2, [128, True]]                   # 19  P2/4-xsmall

  - [-1, 1, Conv, [128, 3, 2]]                   # 20
  - [[-1, 16], 1, Concat, [1]]                   # 21
  - [-1, 2, C3k2, [256, True]]                   # 22  P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  - [[-1, 13], 1, Concat, [1]]                   # 24
  - [-1, 2, C3k2, [512, True]]                   # 25  P4/16-medium

  - [[19, 22, 25], 1, Detect, [nc]]              # Detect(P2, P3, P4)
